# 1주차 복습
---

### Q. 연습문제 : input()
- int(input()) 함수를 이용해서 유저에게서 입력 값을 받아오는 변수
- 90,80,70,이외 점수 이상이면 "A","B","C","F" 출력
- 함수(사전입력), 변수input(사후입력)

In [13]:
#함수 입력

def func_score(x):
    if int(x)>90:
        print("A")
    elif int(x)>80:
        print("B")
    elif int(x)>70:
        print("c")
    else:
        print("F")
        
func_score(83)

B

In [14]:
#input함수 입력

score = int(input("점수를 입력하시오 : "))

if score >= 90:
    print("A")
elif score >= 80:
    print("B")
elif score >= 70:
    print("c")
else:
    print("F")

B

### Q. 연습문제 : while문으로 list의 원소 하나씩 출력

In [21]:
List = ["A", "B", "C", "D"]
i=0

while i < len(List):
    print(List[i])
    i += 1

A
B
C
D

### Q. 연습문제 : 반복문, continue, break
- 반복문을 이용해서 1-100까지 반복
- 25부터 45까지의 합계를 출력

In [25]:
# for문
sum = 0

for i in range(1, 100, 1):
    if i < 25:
#    if i < 25 and i <= 45
        continue
    elif i > 45:
        break
    
    sum += i
    
print(sum)

735

In [26]:
# while문
i = 1
sum = 0

while i <= 100:
    if i < 25:
        i += 1
# while문은 i가 자동으로 증가하지 않기에 i+=1을 해줘야한다.
        continue
    elif i > 45:
        break

    i += 1
    sum += i

print(sum)

756

### Q. 연습문제
- 함수를 생성
- 매개변수 x,y,z 3개
- z가 참이면 x+y 리턴
- z가 부정이면 x-y 리턴
- z의 타입이 bool의 형태가 아니면 "z의 타입은 bool의 형태여야 합니다" 리턴

In [33]:
def func_bool(x, y, z):
    if type(z) == bool:
        if z == True:
            return x+y
        elif z == False:
            return x-y
    
    else:
        print("z의 타입은 bool의 형태여야 합니다")
        
func_bool(2, 1, True)

3

## Class
---
- 이를 위한 매개변수 self가 추가된다. 모든 줄에 존재하니 함수명에 혹은 변수 명에 잘 넣기(첫줄제외)
- class명의 첫글자는 보통 대문자.

In [3]:
class Class_1():    #붕어빵 틀 이름
    def __init__(self):
        self.result = "Class생성되었습니다."
        
    def output(self):
        return self.result

In [4]:
class_a = Class_1()     #붕어빵 틀에 찍어내기
print(class_a.output())

Class생성되었습니다.

In [6]:
#변수와 함수가 존재하는 클래스 선언
class Class_2():
    def __init__(self,x,y):
        self.x = x
        self.y = y
    def output(self):
        self.result = self.x + self.y
        return self.result

In [7]:
class_b = Class_2(5,4)
class_c = Class_2(10,3)

print(class_b.output())
print(class_c.output())

9
13

### Q. 연습문제 : class
- Class 선언
- init 함수에는 self를 제외한 2개의 매개변수 x,y
- init 함수를 제외한 2개의 함수를 생성
- 1번 함수에서는 x와 y의 곱을 리턴
- 2번 함수에서는 x와 y의 나눗셈을 리턴

In [9]:
class Class_q():
    def __init__(self, x, y):
        self.x = x
        self.y = y
    def supply(self):
        return self.x * self.y
    def divided(self):
        return self.x / self.y

In [11]:
class_d = Class_q(10,2)
print(class_d.supply())
print(class_d.divided())

20
5.0

# DATAFRAME
---
데이터 프레임 -> 스리즈 -> 문자열화 -> 대문자로 변환

In [17]:
import pandas as pd
df = pd.read_csv("../csv/uriage.csv")

df #데이터 프레임
df["item_name"]     #데이터 스리즈
df["item_name"].str     #데이터 문자열화
df["item_name"].str.upper       #데이터 대문자로

- 양쪽공백제거 : strip()
- 좌공백, 우공백제거 : lstrip(), rstrip()
- 공백전체 제거 : replace(" ", "")
### - 스리즈 전체를 공백제거할 때는 **apply + (람다 or 함수)** 사용

In [23]:
df["item_name"].apply(lambda x : x.replace(" ", ""))

#or

def change(x):
    return x.replace(" ","")

df["item_name"].apply(change)

0       상품A
1       상품S
2       상품a
3       상품Z
4       상품a
       ...
2994    상품Y
2995    상품M
2996    상품Q
2997    상품H
2998    상품D
Name: item_name, Length: 2999, dtype: object

### Class : 공백제거, 대문자변경
- 1.init함수에서는 : 파일 경로를 매개변수를 이용하여 값을 받아오는 작업
- 2.함수 생성 -> 공백제거, 대문자로 변환 리턴 -> 이 함수에서 필요한 매개변수 "특정 컬럼"
- 3.데이터프레임을 리턴
> "_"언더바로 시작하는 이름의 의미는 "입력받는 값이다."

In [29]:
class Class_4():
    def __init__(self, _path):
        self.df = pd.read_csv(_path)

    def change(self, _column):
        #공백제거,대문자화
        self.df[_column] = self.df[_column].str.replace(" ", "")
        self.df[_column] = self.df[_column].str.upper()
        return self.df

    def review(self):
        return self.df

In [ ]:
class_df = Class_4("../csv/uriage.csv")
# class_df.review()

"""item_name컬럼의 공백,대문자화가 진행됌"""
class_df.change("item_name")

> ### *****위 클래스를 mod1.py파일에<br> 저장해서 불러와서 클래스 생성!**
 - "__init__.py" 파일에 있는 클래스안 함수를 추가하여 아래 수행
 - 공백제외,대문자변환 change함수
 - 시계열로 바꾸는 type_datetime함수
 - 시계열자료에서 년월일을 뽑아 각각의 컬럼으로 추가하는 add_timedata

In [55]:
import mod2 #같은 폴더에 있는 mod2폴더를 로드 -> 그 폴더 안에 정의된 class가져옴
import imp #파일이 수정되는 것을 캐치
imp.reload(mod2) #최신화파일 캐치

In [56]:
#mod
class_df_2 = mod2.Class_df("../csv/uriage.csv")

In [57]:
# class_df_2.review()
class_df_2.change("item_name")

         purchase_date item_name  item_price customer_name
0     2019-06-13 18:02       상품A       100.0           김가온
1     2019-07-13 13:05       상품S         NaN           김우찬
2     2019-05-11 19:42       상품A         NaN           김유찬
3     2019-02-12 23:40       상품Z      2600.0           김재현
4      2019-04-22 3:09       상품A         NaN           김강현
...                ...       ...         ...           ...
2994   2019-02-15 2:56       상품Y      2500.0           김정민
2995   2019-06-22 4:03       상품M      1300.0           김재원
2996  2019-03-29 11:14       상품Q         NaN           김지율
2997  2019-07-14 12:56       상품H         NaN           김승주
2998   2019-07-21 0:31       상품D       400.0           정준기

[2999 rows x 4 columns]

In [58]:
class_df_2.type_datetime("purchase_date")

           purchase_date item_name  item_price customer_name
0    2019-06-13 18:02:00       상품A       100.0           김가온
1    2019-07-13 13:05:00       상품S         NaN           김우찬
2    2019-05-11 19:42:00       상품A         NaN           김유찬
3    2019-02-12 23:40:00       상품Z      2600.0           김재현
4    2019-04-22 03:09:00       상품A         NaN           김강현
...                  ...       ...         ...           ...
2994 2019-02-15 02:56:00       상품Y      2500.0           김정민
2995 2019-06-22 04:03:00       상품M      1300.0           김재원
2996 2019-03-29 11:14:00       상품Q         NaN           김지율
2997 2019-07-14 12:56:00       상품H         NaN           김승주
2998 2019-07-21 00:31:00       상품D       400.0           정준기

[2999 rows x 4 columns]

In [59]:
class_df_2.add_timecolumns("purchase_date")

In [64]:
class_df_3 = mod2.Class_df("../csv/Sales Records.csv")
class_df_3.review()

,Region,Country,Item Type,Sales Channel,Order Priority,Order Date,Order ID,Ship Date,Units Sold,Unit Price,Unit Cost,Total Revenue,Total Cost,Total Profit
0,Sub-Saharan Africa,Chad,Office Supplies,Online,L,1/27/2011,292494523,2/12/2011,4484,651.21,524.96,2920025.64,2353920.64,566105.00
1,Europe,Latvia,Beverages,Online,C,12/28/2015,361825549,1/23/2016,1075,47.45,31.79,51008.75,34174.25,16834.50
2,Middle East and North Africa,Pakistan,Vegetables,Offline,C,1/13/2011,141515767,2/1/2011,6515,154.06,90.93,1003700.90,592408.95,411291.95
3,Sub-Saharan Africa,Democratic Republic of the Congo,Household,Online,C,9/11/2012,500364005,10/6/2012,7683,668.27,502.54,5134318.41,3861014.82,1273303.59
4,Europe,Czech Republic,Beverages,Online,C,10/27/2015,127481591,12/5/2015,3491,47.45,31.79,165647.95,110978.89,54669.06
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
9995,Asia,Laos,Beverages,Online,H,7/15/2014,199342048,7/31/2014,8597,47.45,31.79,407927.65,273298.63,134629.02
9996,Europe,Liechtenstein,Cosmetics,Online,C,10/27/2012,763044106,11/1/2012,562,437.20,263.33,245706.40,147991.46,97714.94
9997,Sub-Saharan Africa,Democratic Republic of the Congo,Vegetables,Offline,M,2/14/2013,848579967,3/20/2013,2524,154.06,90.93,388847.44,229507.32,159340.12
9998,Sub-Saharan Africa,South Africa,Meat,Online,L,2/19/2017,298185956,2/22/2017,8706,421.89,364.69,3672974.34,3174991.14,497983.20
9999,Asia,Mongolia,Snacks,Offline,M,4/12/2016,824410903,4/16/2016,361,152.58,97.44,55081.38,35175.84,19905.54